app/controllers/badges_controller.rb

  def create
      @badge = Badge.new(badge_params)
      if @badge.save
---
INSERT INTO "badges" ("description", "student_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "abcdefg"], ["student_id", 1], ["created_at", "2016-01-06 20:17:32.072015"], ["updated_at", "2016-01-06 20:17:32.072015"]]