app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT 1  [["id", 1]]
---
  def get_badges
    student = Student.find(params[:id])