app/controllers/votes_controller.rb

INSERT INTO "votes" ("value", "badge_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["value", 1], ["badge_id", 1], ["created_at", "2016-01-06 19:08:12.733660"], ["updated_at", "2016-01-06 19:08:12.733660"]]
SELECT  "badges".* FROM "badges" WHERE "badges"."id" = $1 LIMIT 1  [["id", nil]]
UPDATE "badges" SET "score" = $1, "updated_at" = $2 WHERE "badges"."id" = $3  [["score", 1], ["updated_at", "2016-01-06 19:09:30.895272"], ["id", 1]]
---
  def create
    vote = Vote.create(value: params[:value], badge_id: params[:badge_id])
    badge = Badge.find(params[:badge_id])
    badge.update(score: badge.points)